src/main/webapp/WEB-INF/Content/createIncident.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://schemas.hp.com/SM/7" xmlns:com="http://schemas.hp.com/SM/7/Common" xmlns:xm="http://www.w3.org/2005/05/xmlmime">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:CreateIncidentv2Request attachmentInfo="false" attachmentData="false" ignoreEmptyElements="true" updateconstraint="0">
         <ns:model>
            <ns:keys updatecounter="0"/>
            <ns:instance updatecounter="0">
               <ns:ProblemType type="String" mandatory="false" readonly="false">[REASON]</ns:ProblemType>
               <ns:Severity type="String" mandatory="false" readonly="false">2</ns:Severity>
               <ns:PrimaryAssignmentGroup type="String" mandatory="false" readonly="false">DIGIT EUSURVEY SUPPORT</ns:PrimaryAssignmentGroup>
               <ns:AffectedItem type="String" mandatory="false" readonly="false">SURVEYS</ns:AffectedItem>
               <ns:IncidentDescription type="Array">
                <ns:IncidentDescription mandatory="false" readonly="false" type="String">[MESSAGE]</ns:IncidentDescription>
	            <ns:IncidentDescription mandatory="false" readonly="false" type="String">User name: [ADDITIONALINFOUSERNAME]</ns:IncidentDescription>
	            <ns:IncidentDescription mandatory="false" readonly="false" type="String">User email: [ADDITIONALINFOEMAIL]</ns:IncidentDescription>
				<ns:IncidentDescription mandatory="false" readonly="false" type="String">[ADDITIONALINFO]</ns:IncidentDescription>
	            <ns:IncidentDescription mandatory="false" readonly="false" type="String">Survey title: [ADDITIONALINFOSURVEYTITLE]</ns:IncidentDescription>
	            <ns:IncidentDescription mandatory="false" readonly="false" type="String">Survey alias: [ADDITIONALINFOSURVEYALIAS]</ns:IncidentDescription>
               </ns:IncidentDescription>
               <ns:Resolution type="Array"/>
               <ns:Contact type="String" mandatory="false" readonly="false">[CONTACT]</ns:Contact>
               <ns:ContactFirstName type="String" mandatory="false" readonly="false">[CONTACTFIRSTNAME]</ns:ContactFirstName>
               <ns:ContactLastName type="String" mandatory="false" readonly="false">[CONTACTLASTNAME]</ns:ContactLastName>
               <ns:JournalUpdates type="Array"/>
               <ns:Company type="String" mandatory="false" readonly="false">[COMPANY]</ns:Company>
               <ns:BriefDescription type="String" mandatory="false" readonly="false">[SUBJECT]</ns:BriefDescription>
               <ns:IMTicketStatus type="String" mandatory="false" readonly="false">Assigned</ns:IMTicketStatus>
               <ns:NotifyBy type="String" mandatory="false" readonly="false">E-MAIL</ns:NotifyBy>
               <ns:CallCode type="String" mandatory="false" readonly="false">OTHER</ns:CallCode>
               <ns:Impact type="String" mandatory="false" readonly="false">2</ns:Impact>
               <ns:Workdesc type="Array"/>
            </ns:instance>
         </ns:model>
      </ns:CreateIncidentv2Request>
   </soapenv:Body>
</soapenv:Envelope>